<?php header('Content-type: text/html; charset=utf-8')?>
<?php

$error = $_POST['error'];
$name = $_POST['name'];
$zodiac = $_POST['zodiac'];

if ($zodiac == 1) {
 $zodiac_n = "овен";
} elseif ($zodiac == 2) {  
 $zodiac_n = "телец";
} elseif ($zodiac == 3) {  
 $zodiac_n = "близнецы";
} elseif ($zodiac == 4) {  
 $zodiac_n = "рак";
} elseif ($zodiac == 5) {  
 $zodiac_n = "лев";
} elseif ($zodiac == 6) {  
 $zodiac_n = "дева";
} elseif ($zodiac == 7) {  
 $zodiac_n = "весы";
} elseif ($zodiac == 8) {  
 $zodiac_n = "скорпион";
} elseif ($zodiac == 9) {  
 $zodiac_n = "змееносец";
} elseif ($zodiac == 10) {  
 $zodiac_n = "стрелец";
} elseif ($zodiac == 11) {  
 $zodiac_n = "козерог";
} elseif ($zodiac == 12) {  
 $zodiac_n = "водолей";    
} elseif ($zodiac == 13) {  
 $zodiac_n = "рыбы";   
} else {
 $zodiac_n = "что-то сломали нахуй" ;
}
  
  
$quotes[] = 'ничего не повлияло';
$quotes[] = 'вы сидите прямо перед монитором';
$quotes[] = 'вы заинтересовано смотрите на монитор под небольшим наклоном';
$quotes[] = 'ваш монитор близко к вашим глазам';
$quotes[] = 'вы находитесь в метре от вашего устройства';
$quotes[] = 'ваш монитор к вам достаточно близко ';
srand ((double) microtime() * 1000000);
$random_number = rand(0,count($quotes)-1);

$access = $_COOKIE["astro"];
?>


<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
   <meta http-equiv="content-type" content="text/html; charset=windows-1251">
   <title>Гороскоп от lionovsky.us - шаг третий - ваш прогноз!</title>
</head>
<body text="#000000" bgcolor="#EAEAEA" background="img/back.jpg">
<center><img src="img/logo.gif"></center>
<table width="800" align="center" border="1" bgcolor="#F7F7F7"><tr>
<!-- ГТ -->
<td width="80%">   
<?php if (($error == 1) && ($access != 1)) {
 echo "<p><b>Добрый день.</b> Ваш астропрогноз на завтра сформирован. Мы скорректировали ваше поле на "; 
 echo rand(250, 537);
 echo " мВ. С ваших пальцев получена энергия в размере ";
 echo rand(15, 366);
 echo " мкВ.<br><br> Получив указанные данные, мы сформировали для вас данный астрологический прогноз. Степень его погрешности из-за помех составляет ";
 echo rand(0, 20);
 echo " % </p> <hr>";
   echo "<p>";
   echo "<u><b>";
   echo $name;
   echo "</b>, ";
   echo $zodiac_n;
   echo ".</u><br><br>";
   
  $a1 = array();
  $a1[] = "Меркурий ";
  $a1[] = "Венера ";
  $a1[] = "Луна ";
  $a1[] = "Марс ";
  $a1[] = "Сатурн ";
  $a1[] = "Юпитер ";
  $a1[] = "Солнце ";
  $number = mt_rand(0, count($a1) - 1);
  echo $a1[$number];

  $a2 = array();
  $a2[] = "находится в фазе ";
  $a2[] = "находится в созвездии ";
  $a2[] = "находится в знаке ";
  $a2[] = "ингрессирует в фазу ";
  $a2[] = "ингрессирует в созвездие ";
  $a2[] = "ингрессирует в знак ";
  $a2[] = "трансгрессирует из фазы ";
  $a2[] = "трансгрессирует из созвездия ";
  $a2[] = "трансгрессирует из знака ";
  $number = mt_rand(0, count($a2) - 1);
  echo $a2[$number];

  $a3 = array();
  $a3[] = "овна. ";
  $a3[] = "тельца. ";
  $a3[] = "близенцов. ";
  $a3[] = "рака. ";
  $a3[] = "льва. ";
  $a3[] = "девы. ";
  $a3[] = "весов. ";
  $a3[] = "скорпиона. ";
  $a3[] = "змееносца. ";
  $a3[] = "стрельца. ";
  $a3[] = "козерога. ";
  $a3[] = "водолея. ";
  $a3[] = "рыбы. ";
  $number = mt_rand(0, count($a3) - 1);
  echo $a3[$number];
  
  echo "<br><br>";
  
  $a4 = array();
  $a4[] = "В этот день ";
  $a4[] = "Сегодня ";
  $a4[] = "Вполне возможно, что cегодня ";
  $a4[] = "Не исключено, что в этот день ";
  $a4[] = "Вполне вероятно, что в этот день ";
  $a4[] = "Вероятно, что cегодня ";
  $a4[] = "Очевидно, что в этот день ";
  $a4[] = "Возможно, что cегодня ";
  $a4[] = "Скорее всего, cегодня ";
  $a4[] = "В конце дня ";
  $a4[] = "В течение дня ";
  $number = mt_rand(0, count($a4) - 1);
  echo $a4[$number];
  
  $a5 = array();
  $a5[] = "повезет родившимся в год ";
  $a5[] = "благоволить удача будет родившимся в год ";
  $a5[] = "удача будет на стороне родившихся в год ";
  $number = mt_rand(0, count($a5) - 1);
  echo $a5[$number];
  
  $a6 = array();
  $a6[] = "крысы ";
  $a6[] = "быка ";
  $a6[] = "тигра ";
  $a6[] = "кролика ";
  $a6[] = "дракона ";
  $a6[] = "змеи ";
  $a6[] = "лошади ";
  $a6[] = "овцы ";
  $a6[] = "обезьяны ";
  $a6[] = "петуха ";
  $a6[] = "собаки ";
  $a6[] = "свиньи ";
  $number = mt_rand(0, count($a6) - 1);
  echo $a6[$number];
  
  $a7 = array();
  $a7[] = "под стихией воды. ";
  $a7[] = "под стихией земли. ";
  $a7[] = "под стихией дерева. ";
  $a7[] = "под стихией огня. ";
  $a7[] = "под стихией металла. ";
  $number = mt_rand(0, count($a7) - 1);
  echo $a7[$number];
   
  $a8 = array();
  $a8[] = "Звезды говорят о ";
  $a8[] = "Наши астрологи заявляют о ";
  $a8[] = "Наши астрологи говорят о ";
  $a8[] = "Наблюдения за небесной сферой говорят о ";
  $a8[] = "Звездный свет символизирует о ";
  $a8[] = "Карта звездного неба говорит о ";
  $number = mt_rand(0, count($a8) - 1);
  echo $a8[$number];
  
  $a9 = array();
  $a9[] = "сложившейся благоприятной космической обстановке.<br> ";
  $a9[] = "сложившейся неблагоприятной космической обстановке.<br>";
  $a9[] = "сложившихся благоприятных условиях для новых начинаний.<br>";
  $a9[] = "сложившихся неблагоприятных условиях для новых начинаний.<br>";
  $number = mt_rand(0, count($a9) - 1);
  echo $a9[$number];
  
  echo "<br>";
  	
  $a10 = array();
  $a10[] = "Вы ";
  $a10[] = "Многие считают, что вы ";
  $a10[] = "Многие говорят, что вы ";
  $a10[] = "Близкие говорят, что вы ";
  $a10[] = "Близкие считают, что вы ";
  $a10[] = "Родственники считают, что вы ";
  $a10[] = "Родственники говорят, что вы ";
  $number = mt_rand(0, count($a10) - 1);
  echo $a10[$number];
  
  $a11 = array();
  $a11[] = "творческая личность, ";
  $a11[] = "душа компании, ";
  $a11[] = "добросердечный человек, ";
  $a11[] = "стараетесь совершать добрые поступки, ";
  $a11[] = "жизнерадостный человек, ";
  $a11[] = "эгоистичны, ";
  $a11[] = "свободолюбивый человек, ";
  $a11[] = "веселый человек, ";
  $a11[] = "жизнелюбивый человек, ";
  $number = mt_rand(0, count($a11) - 1);
  echo $a11[$number];
	
  $a12 = array();
  $a12[] = "но иногда вы ";
  $a12[] = "но часто вы ";
  $a12[] = "но временами вы ";
  $a12[] = "однако иногда вы ";
  $a12[] = "однако часто вы ";
  $a12[] = "однако временами вы ";
  $a12[] = "тем не менее, иногда вы ";
  $a12[] = "тем не менее, часто вы ";
  $a12[] = "тем не менее, временами вы ";
  $number = mt_rand(0, count($a12) - 1);
  echo $a12[$number];
  
  $a13 = array();
  $a13[] = "сильно переживаете по пустякам. ";
  $a13[] = "много думаете о прошлом. ";
  $a13[] = "не исполняете обещаний. ";
  $a13[] = "много времени уделяете себе и своей внешности. ";
  $a13[] = "нарочно откладываете важные дела на потом. ";
  $a13[] = "обманываете окружающих себе во благо. ";
  $number = mt_rand(0, count($a13) - 1);
  echo $a13[$number];  
    
  $a14 = array();
  $a14[] = "Знакам вашего созвездия рекомендуется сегодня ";
  $a14[] = "Попробуйте сегодня ";
  $a14[] = "В этот день рекомендуется ";
  $a14[] = "Постарайтесь в этот день ";
  $number = mt_rand(0, count($a14) - 1);
  echo $a14[$number];
    
  $a15 = array();
  $a15[] = "воздержаться от принятия крепких спиртных напитков. ";
  $a15[] = "быть осмотрительнее по дороге на работу. ";
  $a15[] = "быть внимательнее за рулем и не отвлекаться на телефон. ";
  $a15[] = "сохранять чистоту помыслов и чаще улыбаться при разговоре. ";
  $a15[] = "проявить ответственность и чистолюбие. ";
  $a15[] = "пожертвовать личным временем и провести его с родственниками. ";
  $a15[] = "провести время со своими домашними. ";
  $a15[] = "не планировать длительное путешествие. ";
  $a15[] = "не брать кредиты или совершать ответственные сделки. ";
  $number = mt_rand(0, count($a15) - 1);
  echo $a15[$number];
    
  $a16 = array();
  $a16[] = "Не тратьте время на пустые разговоры, кроме того ";
  $a16[] = "Дайте волю эмоциям - ";
  $a16[] = "Принимайте смелые решения, ведь ";
  $a16[] = "Держите под контролем свои эмоции, даже когда ";
  $number = mt_rand(0, count($a16) - 1);
  echo $a16[$number];
  
  $a17 = array();
  $a17[] = "Вам придется бороться с интригами. ";
  $a17[] = "Вы встретите интересного человека. ";
  $a17[] = "Вас будет ждать приятная неожиданность. ";
  $a17[] = "Вы испытаете разочарование в близком человеке. ";
  $a17[] = "Вас ожидает сюрприз или подарок. ";
  $number = mt_rand(0, count($a17) - 1);
  echo $a17[$number];
  
    echo "<br><br>";
  
  $a18 = array();
  $a18[] = "Сегодня будет легко ";
  $a18[] = "Отличный день, чтобы ";
  $a18[] = "Пока еще не настало время, чтобы ";
  $a18[] = "Удачный день для того, чтобы ";
  $a18[] = "Удача на вашей стороне, поэтому полезно будет ";
  $a18[] = "У вас будет уникальная возможность ";
  $number = mt_rand(0, count($a18) - 1);
  echo $a18[$number];
  
  $a19 = array();
  $a19[] = "попросить прощения у других.";
  $a19[] = "познакомиться с новыми людьми.";
  $a19[] = "завести полезные знакомства.";
  $a19[] = "попросить прибавку к зарплате.";
  $a19[] = "сходить куда-нибудь развлечься.";
  $number = mt_rand(0, count($a19) - 1);
  echo $a19[$number];
  
  echo "</p>";
  
  echo "<hr><p><b>Спасибо за пользование сервисом!</b> </p>";
  setcookie("astro", 1, time()+86400);
} elseif ($access == 1) {
	echo "Вы уже получали свой астропрогноз на сегодня.";
} else {
 echo "<center><h1>Получены ошибочные данные!<br>Вы не заполнили форму на первой странице. Данная страница работать не будет!</h1></center>";
}
?>
</td>

<!-- /ГТ -->

</tr></table>
 
<!-- Yandex.Metrika counter -->
<script type="text/javascript" >
    (function (d, w, c) {
        (w[c] = w[c] || []).push(function() {
            try {
                w.yaCounter47424376 = new Ya.Metrika2({
                    id:47424376,
                    clickmap:true,
                    trackLinks:true,
                    accurateTrackBounce:true,
                    webvisor:true
                });
            } catch(e) { }
        });

        var n = d.getElementsByTagName("script")[0],
            s = d.createElement("script"),
            f = function () { n.parentNode.insertBefore(s, n); };
        s.type = "text/javascript";
        s.async = true;
        s.src = "https://mc.yandex.ru/metrika/tag.js";

        if (w.opera == "[object Opera]") {
            d.addEventListener("DOMContentLoaded", f, false);
        } else { f(); }
    })(document, window, "yandex_metrika_callbacks2");
</script>
<noscript><div><img src="https://mc.yandex.ru/watch/47424376" style="position:absolute; left:-9999px;" alt="" /></div></noscript>
<!-- /Yandex.Metrika counter -->

</body>
</html> 
